---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.FlexPipe.StartTangent
source: html/6ec88166-0a20-e0cc-da8e-bc74d27709ea.htm
---
# Autodesk.Revit.DB.Plumbing.FlexPipe.StartTangent Property

Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.

## Syntax (C#)
```csharp
public XYZ StartTangent { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null